{
  "terms": {
    "title": "Умови використання",
    "subtitle": "Будь ласка, уважно прочитайте ці умови перед використанням нашого сервісу",
    "lastUpdated": "Останнє оновлення: {{date}}",
    "importantNotice": {
      "title": "Важливе повідомлення",
      "content": "Ці умови використання регулюють ваш доступ та використання Калькулятора евапотранспірації IrrigAIte UA. Використовуючи наш сервіс, ви погоджуєтесь дотримуватися цих умов."
    },
    "sections": {
      "acceptance": {
        "title": "1. Прийняття умов",
        "paragraph1": "Отримуючи доступ або використовуючи Калькулятор евапотранспірації IrrigAIte UA (\"Сервіс\"), ви погоджуєтесь дотримуватися цих Умов використання (\"Умови\"). Якщо ви не погоджуєтесь з цими Умовами, будь ласка, не використовуйте наш Сервіс.",
        "paragraph2": "Ми можемо час від часу оновлювати ці Умови. Ваше подальше використання Сервісу після будь-яких змін означає прийняття нових Умов. Ми повідомлятимемо користувачів про значні зміни через електронну пошту або помітне повідомлення в нашому сервісі."
      },
      "services": {
        "title": "2. Опис сервісу",
        "paragraph1": "IrrigAIte UA надає калькулятор евапотранспірації, спеціально розроблений для українських сільськогосподарських умов. Сервіс включає:",
        "features": {
          "pet": "Розрахунки потенційної евапотранспірації (ПЕТ) з використанням регіональних ML моделей",
          "etc": "Розрахунки евапотранспірації культур (ETc) на основі рекомендацій ФАО",
          "irrigation": "Рекомендації щодо зрошення на основі вологості ґрунту та потреб культур",
          "map": "Інтерактивний картографічний інтерфейс для вибору регіону",
          "auth": "Автентифікація користувачів та управління обліковими записами",
          "history": "Збереження та отримання історії розрахунків користувача",
          "license": "Активація та управління ліцензійними ключами для додаткових оцінок",
          "education": "Освітні ресурси та рекомендації"
        }
      },
      "usage": {
        "title": "3. Використання сервісу",
        "paragraph1": "Ви можете використовувати наш Сервіс для законних цілей, пов'язаних з плануванням сільського господарства та освітою. Ви погоджуєтесь:",
        "rules": {
          "accuracy": "Надавати точну інформацію при використанні калькулятора та створенні облікового запису",
          "purpose": "Використовувати Сервіс лише за його призначенням для сільськогосподарських та освітніх цілей",
          "security": "Підтримувати безпеку облікових даних вашого облікового запису",
          "license": "Використовувати ліцензійні ключі відповідально та лише для індивідуального використання (не для спільного використання або перепродажу)",
          "interference": "Не намагатися втручатися або порушувати роботу Сервісу чи його заходів безпеки",
          "legal": "Не використовувати Сервіс для будь-яких незаконних або несанкціонованих цілей",
          "ip": "Поважати права інтелектуальної власності Сервісу",
          "reverse": "Не намагатися зворотно інженерувати або витягувати власні алгоритми"
        }
      },
      "userAccounts": {
        "title": "4. Облікові записи користувачів та дані",
        "paragraph1": "Для доступу до певних функцій Сервісу ви повинні створити обліковий запис. Ви несете відповідальність за:",
        "responsibilities": {
          "confidentiality": "Підтримання конфіденційності облікових даних вашого облікового запису",
          "activities": "Всі дії, що відбуваються під вашим обліковим записом",
          "unauthorized": "Негайне повідомлення нас про будь-яке несанкціоноване використання вашого облікового запису",
          "accuracy": "Забезпечення точності інформації, яку ви надаєте"
        },
        "paragraph2": "Ми зберігаємо вашу історію розрахунків, профіль користувача та дані використання ліцензійних ключів для надання персоналізованих послуг. Ви можете керувати та видаляти свої дані через налаштування облікового запису або звернувшись до служби підтримки."
      },
      "licenseKeys": {
        "title": "5. Ліцензійні ключі та оцінки",
        "paragraph1": "Ліцензійні ключі надають додаткові оцінки ПЕТ понад безкоштовний рівень. Купуючи та використовуючи ліцензійні ключі:",
        "terms": {
          "activation": "Кожен ліцензійний ключ може бути активований лише один раз і не підлягає передачі",
          "individual": "Ліцензійні ключі призначені для індивідуального використання і не можуть бути переданими, перепроданими або розповсюдженими",
          "expiration": "Оцінки не мають терміну дії, але витрачаються з кожним розрахунком ПЕТ",
          "fraud": "Ми залишаємо за собою право деактивувати ключі, отримані шахрайським шляхом",
          "refunds": "Повернення коштів розглядається в індивідуальному порядку для невикористаних оцінок",
          "support": "Покупка ліцензійних ключів допомагає підтримувати постійний розвиток та витрати на API"
        }
      },
      "disclaimer": {
        "title": "6. Відмова від гарантій",
        "importantDisclaimer": {
          "title": "ВАЖЛИВЕ ЗАСТЕРЕЖЕННЯ:",
          "content": "Розрахунки та рекомендації, надані цим Сервісом, призначені лише для інформаційних цілей. Фактичні рішення щодо зрошення повинні враховувати місцеві умови, аналіз ґрунту, погодні умови та професійні сільськогосподарські поради."
        },
        "paragraph1": "Сервіс надається \"як є\" без будь-яких гарантій, явних чи неявних, включаючи, але не обмежуючись гарантіями товарності, придатності для конкретної мети або ненарушення прав.",
        "paragraph2": "Ми не гарантуємо, що Сервіс буде безперервним, безпомилковим або повністю безпечним. Погодні дані, розрахунки та збережена інформація можуть містити неточності або бути предметом технічних збоїв."
      },
      "liability": {
        "title": "7. Обмеження відповідальності",
        "paragraph1": "У жодному разі IrrigAIte UA, його оператори або учасники не несуть відповідальності за будь-які непрямі, випадкові, спеціальні, наслідкові або штрафні збитки, включаючи, але не обмежуючись:",
        "damages": {
          "profits": "Втрата прибутків або доходів",
          "crops": "Втрати врожаю або сільськогосподарські збитки",
          "business": "Переривання бізнесу",
          "data": "Втрата даних або інформації",
          "substitute": "Вартість замінних товарів або послуг",
          "access": "Несанкціонований доступ до ваших даних або їх зміна"
        },
        "paragraph2": "Це обмеження застосовується незалежно від того, чи виникають такі збитки від договору, деліктного права, недбалості або будь-якої іншої правової теорії, і навіть якщо нас попередили про можливість таких збитків."
      },
      "privacy": {
        "title": "8. Дані та конфіденційність",
        "paragraph1": "Ми збираємо та обробляємо особисту інформацію, як описано в нашій Політиці конфіденційності. Ключові моменти включають:",
        "points": {
          "accounts": "Облікові записи користувачів необхідні для збереження розрахунків та активації ліцензійних ключів",
          "storage": "Ми зберігаємо вашу історію розрахунків, профіль користувача та дані використання ліцензійних ключів",
          "security": "Дані зберігаються безпечно з використанням інфраструктури Supabase з безпекою на рівні рядків",
          "access": "Ви можете отримувати доступ, змінювати та видаляти свої дані через свій обліковий запис",
          "selling": "Ми не продаємо вашу особисту інформацію третім сторонам"
        },
        "paragraph2": "Для отримання повної інформації про збір, зберігання та обробку даних, будь ласка, зверніться до нашої",
        "privacyLink": "Політики конфіденційності"
      },
      "scientific": {
        "title": "9. Наукова точність",
        "paragraph1": "Хоча ми прагнемо до наукової точності, використовуючи встановлені методології, користувачі повинні знати, що:",
        "limitations": {
          "models": "Розрахунки базуються на математичних моделях і можуть не враховувати всі місцеві фактори",
          "weather": "Точність погодних даних залежить від сторонніх джерел (OpenWeatherMap API)",
          "coefficients": "Коефіцієнти культур базуються на стандартних рекомендаціях ФАО і можуть відрізнятися за сортами",
          "soil": "Параметри ґрунту слід перевіряти за допомогою місцевого тестування, коли це можливо",
          "validation": "Результати слід перевіряти проти місцевого сільськогосподарського досвіду та польових спостережень",
          "regional": "Регіональні моделі калібровані для українських умов, але можуть потребувати місцевих коригувань"
        }
      },
      "intellectualProperty": {
        "title": "10. Інтелектуальна власність",
        "paragraph1": "Сервіс, включаючи його дизайн, функціональність та контент, захищений законами про інтелектуальну власність. Основні сільськогосподарські формули та рекомендації ФАО базуються на публічно доступних наукових дослідженнях.",
        "paragraph2": "Ви не можете відтворювати, розповсюджувати або створювати похідні роботи на основі Сервісу без дозволу, за винятком особистого сільськогосподарського використання. ML моделі та регіональні коефіцієнти представляють власні дослідження та розробки.",
        "paragraph3": "Ви зберігаєте право власності на сільськогосподарські дані, які ви вводите, але надаєте нам ліцензію на їх використання для надання та покращення Сервісу."
      },
      "availability": {
        "title": "11. Доступність сервісу",
        "paragraph1": "Ми прагнемо підтримувати високу доступність сервісу, але не можемо гарантувати безперервний доступ:",
        "conditions": {
          "maintenance": "Сервіс може бути тимчасово недоступний через технічне обслуговування, оновлення або технічні проблеми",
          "dependencies": "Залежності від третіх сторін (погодні API, Supabase) можуть впливати на доступність сервісу",
          "notice": "Ми надамо розумне повідомлення про планове технічне обслуговування, коли це можливо",
          "security": "Ваші дані залишаються безпечними під час переривань сервісу"
        }
      },
      "termination": {
        "title": "12. Припинення",
        "paragraph1": "Ми залишаємо за собою право припинити або призупинити доступ до Сервісу в будь-який час, з попереднім повідомленням або без нього, з будь-якої причини, включаючи порушення цих Умов. Ви також можете припинити свій обліковий запис у будь-який час.",
        "paragraph2": "Після припинення ваше право на використання Сервісу негайно припиняється. Ми зберігатимемо ваші дані відповідно до нашої Політики конфіденційності і можемо надати вам можливість експортувати ваші дані перед остаточним видаленням."
      },
      "governingLaw": {
        "title": "13. Застосовне право",
        "content": "Ці Умови регулюються та тлумачаться відповідно до застосовного законодавства. Будь-які спори, що виникають з цих Умов або використання Сервісу, вирішуються через відповідні правові канали. Ми докладатимемо розумних зусиль для мирного вирішення спорів перед зверненням до правових дій."
      },
      "contact": {
        "title": "14. Контактна інформація",
        "paragraph1": "Якщо у вас є запитання щодо цих Умов використання, потрібна підтримка з вашим обліковим записом або ви хочете повідомити про проблеми, будь ласка, зв'яжіться з нами через відповідні канали, надані на нашому веб-сайті.",
        "lastUpdated": "Останнє оновлення: {{date}}"
      }
    }
  },
  "privacy": {
    "title": "Політика конфіденційності",
    "subtitle": "Як ми захищаємо та обробляємо вашу інформацію",
    "lastUpdated": "Останнє оновлення: {{date}}",
    "commitment": {
      "title": "Наші зобов'язання щодо конфіденційності",
      "content": "Ми зобов'язуємося захищати вашу конфіденційність та забезпечувати безпеку будь-якої інформації, яку ви надаєте під час використання калькулятора IrrigAIte UA. Ми збираємо лише дані, необхідні для надання та покращення наших послуг."
    },
    "sections": {
      "informationCollection": {
        "title": "1. Інформація, яку ми збираємо",
        "userProvided": {
          "title": "Інформація, яку ви надаєте",
          "intro": "При створенні облікового запису та використанні нашого калькулятора ви можете надати:",
          "items": {
            "account": "Інформація облікового запису: Адреса електронної пошти та пароль (безпечно обробляються автентифікацією Supabase)",
            "agricultural": "Сільськогосподарські дані: Вибір регіону, типи культур, дати посадки, параметри ґрунту та налаштування зрошення",
            "history": "Історія розрахунків: Ваші збережені розрахунки ПЕТ та зрошення, включаючи результати та часові мітки",
            "license": "Дані ліцензійних ключів: Записи активації ліцензійних ключів та відстеження використання оцінок"
          },
          "important": "Важливо: Ця інформація пов'язана з вашим обліковим записом користувача та безпечно зберігається в нашій базі даних Supabase."
        },
        "automaticallyCollected": {
          "title": "Автоматично зібрана інформація",
          "intro": "Ми можемо автоматично збирати певну технічну інформацію:",
          "items": {
            "browser": "Тип та версія браузера",
            "os": "Операційна система",
            "ip": "IP-адреса (анонімізована для аналітики)",
            "usage": "Статистика використання та перегляди сторінок",
            "errors": "Журнали помилок для покращення сервісу",
            "auth": "Дані сесії автентифікації (керуються Supabase)"
          }
        }
      },
      "informationUsage": {
        "title": "2. Як ми використовуємо вашу інформацію",
        "serviceProvision": {
          "title": "Надання послуг",
          "items": {
            "calculate": "Розрахунок показників евапотранспірації",
            "recommendations": "Надання рекомендацій щодо зрошення",
            "weather": "Отримання погодних даних для вашого регіону",
            "history": "Збереження та отримання вашої історії розрахунків",
            "license": "Управління вашими оцінками ліцензійних ключів",
            "personalized": "Надання персоналізованого користувацького досвіду"
          }
        },
        "serviceImprovement": {
          "title": "Покращення сервісу",
          "items": {
            "patterns": "Аналіз шаблонів використання",
            "issues": "Виявлення та виправлення технічних проблем",
            "accuracy": "Покращення точності розрахунків",
            "experience": "Покращення користувацького досвіду",
            "features": "Розробка нових функцій",
            "validation": "Валідація наукових моделей"
          }
        }
      },
      "dataStorage": {
        "title": "3. Зберігання та безпека даних",
        "storage": {
          "title": "Зберігання даних",
          "intro": "Ваші дані зберігаються безпечно з використанням стандартних галузевих практик:",
          "items": {
            "persistent": "Облікові записи користувачів, історія розрахунків та дані ліцензійних ключів зберігаються постійно в базі даних Supabase",
            "passwords": "Паролі не зберігаються нашим додатком - вони безпечно обробляються службою автентифікації Supabase",
            "agricultural": "Сільськогосподарські дані пов'язані з вашим обліковим записом користувача для персоналізованого сервісу",
            "weather": "Погодні дані кешуються тимчасово для оптимізації продуктивності",
            "analytics": "Статистика використання анонімізується та агрегується для аналітики"
          }
        },
        "security": {
          "title": "Заходи безпеки",
          "intro": "Ми впроваджуємо комплексні заходи безпеки для захисту ваших даних:",
          "items": {
            "encryption": "Зашифрована передача даних (HTTPS/TLS)",
            "infrastructure": "Надійна інфраструктура безпеки Supabase та стандарти відповідності",
            "rls": "Безпека на рівні рядків (RLS), що забезпечує доступ користувачів лише до власних даних",
            "updates": "Регулярні оновлення безпеки та патчі",
            "access": "Контроль доступу та моніторинг",
            "auth": "Безпечні механізми автентифікації"
          }
        }
      },
      "thirdPartyServices": {
        "title": "4. Сторонні сервіси",
        "supabase": {
          "title": "Supabase (База даних та автентифікація)",
          "intro": "Ми використовуємо Supabase як наш основний постачальник backend-сервісів:",
          "items": {
            "auth": "Автентифікація користувачів та управління обліковими записами",
            "database": "Хостинг бази даних для історії розрахунків та профілів користувачів",
            "functions": "Безсерверні функції (Edge Functions) для активації ліцензійних ключів",
            "processing": "Ваші дані обробляються та зберігаються Supabase від нашого імені",
            "compliance": "Supabase відповідає галузевим стандартам безпеки та регулюванням"
          }
        },
        "weather": {
          "title": "Постачальники погодних даних",
          "intro": "Ми використовуємо сторонні погодні сервіси для надання поточних даних про температуру:",
          "items": {
            "api": "OpenWeatherMap API для даних про температуру в реальному часі",
            "coordinates": "Координати місцезнаходження використовуються лише для вибору метеостанції",
            "privacy": "Особиста інформація не передається постачальникам погодних даних",
            "anonymized": "Запити погодних даних анонімізовані"
          }
        },
        "analytics": {
          "title": "Аналітика та моніторинг",
          "content": "Ми можемо використовувати аналітичні інструменти для розуміння використання сервісу та покращення продуктивності. Всі аналітичні дані анонімізовані та не містять особистої інформації."
        }
      },
      "cookies": {
        "title": "5. Файли cookie та відстеження",
        "essential": {
          "title": "Основні файли cookie та управління сесіями",
          "intro": "Наш сервіс використовує основні файли cookie та сховище сесій для функціональності:",
          "items": {
            "auth": "Управління сесією автентифікації (Supabase)",
            "preferences": "Зберігання користувацьких налаштувань (мова, одиниці)",
            "calculator": "Збереження стану калькулятора",
            "analytics": "Базова аналітика (анонімізована)"
          },
          "note": "Ми не використовуємо файли cookie для відстеження або сторонні рекламні файли cookie."
        }
      },
      "dataSharing": {
        "title": "6. Обмін даними",
        "noSelling": {
          "title": "Відсутність продажу даних",
          "intro": "Ми не продаємо, не обмінюємо та не передаємо вашу особисту інформацію третім сторонам для комерційних цілей.",
          "limited": "Інформація може бути передана лише в наступних обмежених обставинах:",
          "items": {
            "legal": "Правові вимоги або урядові запити",
            "protection": "Захист наших прав та власності",
            "emergency": "Надзвичайні ситуації, що стосуються громадської безпеки",
            "providers": "З постачальниками послуг (як Supabase), які допомагають в роботі нашого сервісу"
          }
        }
      },
      "userRights": {
        "title": "7. Ваші права",
        "access": {
          "title": "Доступ та контроль",
          "intro": "У вас є наступні права щодо ваших збережених даних:",
          "items": {
            "access": "Доступ: Перегляд вашої історії розрахунків через сторінку \"Мої розрахунки\"",
            "delete": "Видалення: Видалення окремих розрахунків або всього вашого облікового запису",
            "correct": "Виправлення: Оновлення інформації вашого облікового запису та налаштувань",
            "export": "Експорт: Запит копії ваших даних, звернувшись до служби підтримки",
            "control": "Контроль: Управління налаштуваннями конфіденційності та налаштуваннями обміну даними"
          }
        },
        "portability": {
          "title": "Портативність та видалення даних",
          "intro": "Ви можете скористатися своїми правами на дані через:",
          "items": {
            "settings": "Налаштування облікового запису та управління профілем",
            "individual": "Індивідуальне видалення розрахунків у \"Мої розрахунки\"",
            "account": "Видалення облікового запису (видаляє всі пов'язані дані)",
            "support": "Звернення до служби підтримки для запитів на експорт даних"
          }
        }
      },
      "childrenPrivacy": {
        "title": "8. Конфіденційність дітей",
        "content": "Наш сервіс не призначений для дітей віком до 13 років. Ми свідомо не збираємо особисту інформацію від дітей віком до 13 років. Якщо ви вважаєте, що ми зібрали таку інформацію, будь ласка, негайно зв'яжіться з нами, і ми вживемо заходів для її видалення."
      },
      "dataRetention": {
        "title": "9. Зберігання даних",
        "intro": "Ми зберігаємо ваші дані доти, доки ваш обліковий запис активний або доки це необхідно для надання послуг:",
        "items": {
          "account": "Дані облікового запису: Зберігаються до видалення облікового запису",
          "calculations": "Історія розрахунків: Зберігається до ручного видалення або видалення облікового запису",
          "license": "Записи ліцензійних ключів: Зберігаються для цілей аудиту та підтримки",
          "analytics": "Аналітичні дані: Анонімізовані та зберігаються для покращення сервісу"
        }
      },
      "policyChanges": {
        "title": "10. Зміни в цій політиці",
        "updates": "Ми можемо час від часу оновлювати цю Політику конфіденційності, щоб відобразити зміни в наших практиках або з інших операційних, правових або регуляторних причин. Будь-які зміни будуть опубліковані на цій сторінці з оновленою датою перегляду.",
        "notification": "Ми повідомлятимемо користувачів про значні зміни через електронну пошту або помітне повідомлення в нашому сервісі. Продовження використання сервісу після змін політики означає прийняття оновленої політики."
      },
      "contact": {
        "title": "11. Контактна інформація",
        "content": "Якщо у вас є запитання щодо цієї Політики конфіденційності, наших практик конфіденційності або ви хочете скористатися своїми правами на дані, будь ласка, зв'яжіться з нами через відповідні канали, надані на нашому веб-сайті."
      }
    }
  }
}